Tekla Open API Reference for Tekla Structures 2025
SectionMarkTagAttributes Methods
The SectionMarkBase.SectionMarkTagAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ViewMarkBasicTagAttributes.IsEqual(Object).)
Top
See Also
Reference
SectionMarkBase.SectionMarkTagAttributes Class
Tekla.Structures.Drawing Namespace